{"blogs": [
{
    "id": 1,
    "description" : "To Buy or to Build?",
    "image" : "https://innovativeinternationalrealty.com/wp-content/uploads/2023/09/Screen-Shot-2023-09-12-at-8.57.21-PM-1-1170x726.png",
    "clickBait":"To buy or to build?",
    "blogContent":"<p>At some point in our lives, we all desire to be homeowners, whether for our own security and stability or as a tried, tested tangible investment asset.Whatever your motivation, the decision to own a residential property can be daunting.However, any one of the two clear ways of acquiring the asset - to build one yourself or to buy a ready development. <h3>Cost</h3> <p>First and foremost, the cost involved is a very big determinant of whether one will choose to buy or build. When considering building your own home, other than the cost of construction, it is important to factor in the cost of land purchase as well as relevant fees including project consultants, quantity surveyors, engineers, architects, contractors and county permits, approvals and licenses if you plan on getting a good finished product. Buying a home on the other hand will cover all these costs in the final price, though you will still have to factor in costs such as mortgage finance, legal fees, stamp duty, insurance, service charge and even the furnishing of the house.</p> <h3>Design</h3><p>Today, many leading property developers working on scale projects consult field experts in various matters before making any decisions on design and finishes. These professionals include quantity surveyors, landscapers, valuers, feasibility study experts, interior designers and architects who are up to speed with current requirements, styles and preferences in the market. For example, these professionals will be able to advise a property developer on whether or not to have an open-plan kitchen, and how this relates to social demographics in the urban residential market. While a ready development offers a specific design, building your own single residential villa or townhouse means that you are able to personalise every detail from floor plan design, and interiors to finishes according to your taste and living preferences.</p> <h3>Value</h3> <p>The value of the home should be weighed against the location, proximity to workplace, schools, hospitals, total living space, amenities including security, access of property, gym, sauna, pool and quality of finishes like tiles, ready provisions like gas cooker with extractor and hood and so on.Building a home from scratch complete with amenities like a gym and pool is more common in higher-income individuals due to the high installation and maintenance costs. </p> <h3>Financing</h3>In both buying and constructing a home, it is really important to understand your financial muscle. Have a clear plan on how you will finance the project. If taking a mortgage to buy a home, do you have a stable and secure income? Is it a home that needs renovations or maintenance?If constructing, are you using savings or are you taking a loan to finance the construction? Is the land price competitive? Cost and timeline of rent as your house is being built? What kind of tax benefits do you get?How will you factor in depreciation over time? What kind of timeline are you looking at for construction and repayment?Involving the spouse in the decision is also critical as the financial commitments can be planned and met together as a family. Ideally, reputed developers will manage their project costs, teams, timelines and construction progress so shopping for a house means you get to choose something that suits your lifestyle, and your income as you plan for long-term stability.</p> <h3>Research</h3> <p>It is equally important to have done thorough research and be familiar with the developer you are potentially transacting with before you settle on buying a ready home. For example, what is their track record in project completion? You definitely do not want to deal with a developer who has many projects yet none or some are actually completed. Or one who promises to finish a project this year but takes three more years to complete the project. The same goes for contractors and teams should you choose to build your own home. How well do you know them? What kind of terms and timelines do they promise versus deliver? How does the contractor's financial model work? Do they have clear accountability and work plans? Consult people who you trust and who have experience. Plan, think and then make decisions that are not influenced by pressure or 'easy way out' hacks. Should you decide to buy a home, especially off-plan, always visit the site to see progress. Visiting the site also gives you an opportunity to visualise the final outcome. We have many accounts of people buying non-existent projects because they never took the time to visit the project site. Get a lawyer to help you understand and negotiate terms with a developer or bank as there are currently no firm regulations protecting the buyer in Kenya. The pivotal factor is the cost when deciding on buying vs building, data shows that building a home costs 20 to 30 per cent more on average. When applying for a building or construction loan, the bank may have its own process for paying contractors. Whether you decide to buy or build, be clear on what you are looking for. Understand your financial strength and plan, and do your research.</p>"
},
{
    "id": 2,
    "description" : "Bungalow V Maisonette?",
    "image" : "https://i.pinimg.com/736x/09/c6/99/09c699fab2f1acef2e982e856d262193.jpg",
    "clickBait":"5 Factors to differentiate bungalow house designs and maisonette house designs Kenya",
    "blogContent":"<h3>Cost comparison</h3><p>Maisonette will require an additional slab for the upper floor. However, in the process of taking some rooms up, there are other cost savings. For example, a maisonette will require a smaller foundation area since it extends upward or vertically compared to bungalow house plans which extends horizontally hence a bigger foundation area. </p><h4>Roofing</h4><p>Just like a foundation, a maisonette will require almost half of the size of the roof required for a bungalow. This will translate to savings on roofing materials such as timber, nails, iron sheets and labour. Most people when researching through a pool of house plans in Kenya rarely looks at the roofing materials. </p><h4>Size of land</h4><p>This should be the biggest decision making factor. It’s common knowledge that the prices of land in towns are very high and plots tend to be smaller in size. In many places you would find the biggest size people acquire is an eighth of an acre (50×100) but in places like cities, even that an eighth is not available. So people go for a half of an eighth (50×50). When selecting a house plan for the large pool of house plans in Kenya out there, take time to think of the size of the house suitable for your land. To get the most out of the small size of land, maisonette house plan becomes more attractive because of the relatively small area required for the foundation. A caution for those buying land is to ensure that you use a surveyor to actually establish the actual size of the land as the one indicated in the title and the location as well. Maisonette house designs tend to be more secure than bungalows because of fewer windows and doors. Many people tend to use security doors separating the top and low levels just in case of a security breach. </p><h3>Land use</h3><p>When you have small land, the best option is to go for a maisonette house design so that you can leave some space for other usages such as parking, garden or compound. A bungalow house design will occupy a bigger space and will minimize the portions which could have been left for other needs. Much as there are so many house plans in Kenya, think of one which will best utilize your land. </p><h3>Individual Preference</h3> <p>This is largely a personal choice but a maisonette house plan is considered much classier than a bungalow house plan. From the design perspective, there is much more you can do on the elevations of maisonette house designs as compared to bungalow house designs. As you review all the house plans in Kenya at your disposal, think of one which caters for your preferences. A dream home will only be achieved with a house plan which has taken care of your preferences. </p><h3>Privacy</h3><p>The maisonette is considered to offer more privacy than a bungalow would offer. The upper floor is used for private spaces and makes it possible to attain some level of privacy. To have a dream home, your privacy must be covered properly.</p><h3>Finally</h3> <p>From a developer’s point of view, it’s difficult to pick between bungalow house designs and a maisonette house design. It all boils down to personal preferences, house design and materials used. What we can tell for a fact is that we are available to help you make decisions from the pool of house plans in Kenya out there and also make your dream come true. Don’t fear discussing with us what you have chosen from house plans in Kenya. Any bungalow house designs or maisonette house designs you are considering for your project and how we could be of great help. Talk to us to help you achieve your dream home."
},
{
    "id": 3,
    "description" : "Roofing Designs",
    "image" : "https://cdn.homedit.com/wp-content/uploads/roof-types/Common-roof-types.jpg",
    "clickBait":"Choose your roof poison",
    "blogContent":"<h3>Hipped Roof</h3> <p>When it comes to hipped roofing, the stopes appear on both sides of the house meeting at the top. At this peak they form a ridge, Hipped roofs is one of the most common roofs in Kenya especially with the single family homes dotted across the country.In terms of advantages, this roofing provides a beautiful views of the roof when done with great quality roofing tiles or sheets, Secondly, they offer enhanced strength to the roof due to the four sided sloping thus improving its durability.Additionally, hipped roofing also provides extra space above the llving space that could be utilized for water tank storage or creating an attic for extra storage space</p> <h3>Gable Roofing</h3> <p>With gable Roofing, there are only two sloping roof surfaces on each side meeting at the peak where they form a ridge. For such roofing, it's common for rectangular construction projects such as classrooms, rural houses and other related buildings. The roofing is also referred to as 'A' frame roofing design,Gable roofingGenerally, gable Roofing is best for projects with tight budgets and the client wants to save as much as possible on roofing timber and roofing sheets.</p> <h3>Flat Roofing</h3> <p>The third roofing model in Kenya gaining widespread adoption is flat Roofing. Previously used on commercial  spaces only, they have gained alot of prominence in residential housing as well.For flat roofs, a client can either opt for a hidden roof. This is the roofing sheets or tiles are hidden by a rising  concrete pillar. This concept is very common with mosques The other design is using a concrete floor that's waterproofed to prevent water sipping through the wall. With this  design, you can take advantage of the created space as a recreational spot or hosting family events </p> <h3>Skillion Roofing </h3> <p>Skillion Roofing  The Skillion Roofs are the most basic and traditional of the roofing designs in Kenya that has regained popularity  With skillion, the roof only slopes from one raised side of the wall to a lower raised wall. Hence forming a wedge  model.  This design is commonly used in the construction of farm sheds, servant quarters, rural kitchen houses among  others. Interestingly, skillion roofing has now also been adopted in modern architectural designs as shown in the  picture. <p>"
},
{
    "id": 4,
    "description" : "Machine Cut or Bush stones",
    "image" : "https://images.timesproperty.com/blog/5517/stones_in_construction.jpg",
    "clickBait":"Ndarugo stones or quarry Stones",
    "blogContent":"<h3>What stones are good for building?</h3> <p>Wondering what stones are good for building? In Kenya, two types of stones are commonly used in construction: ndarugo stones and quarry stones. Both of these stones have distinct properties that make them suitable for a variety of building applications. This article will explain what ndarugo stones and quarry stones are and how they are used in construction.</p> <h3>Ndarugo Stones</h3> <p> Machine-cut stones are another name for Ndarugo stones. They are commonly used in the construction of walls, foundations, and pavements. These stones are created by cutting and shaping Rift Valley volcanic rocks. The volcanic rocks are mined first, then cut into various sizes and shapes with special machinery. Because of their durability and strength, Ndarugo stones are a popular building material in Kenya. They are weather and erosion resistant.In comparison to other types of stones, these stones are cheaper. They are easily accessible throughout the nation, particularly in central Kenya, where they serve as the main material of both residential and commercial construction. Ndarugo stones can be used for landscaping, for example building retaining walls, garden walkways in addition to being utilized for walls, foundations, and pavements.<h3>Quarry Stones</h3> <p> Quarry stones are naturally occurring stones that are mined from quarries. They are extensively utilized in the construction of walls and facades In Kenya. They are sold on a` per feet basis unlike machine cut stones that are sold on a per piece basis. These stones tend to be the most preferred for use as foundation stones. They are however, not the best for constructing walls as they utilize too much cement and sand. This is due to their rough edges.Quarry stones are advantageous though, in that they are resilient to all kinds of weather.</p> <p>In conclusion, ndarugo stones and quarry stones are popular building materials in Kenya. Ndarugo stones are affordable, durable, and readily available, making them a popular choice for residential and commercial buildings. Quarry stones, on the other hand, are natural stones that are known for their strength, durability, and aesthetic value. Coral stone, granite, and limestone are just a few examples of the quarry stones available in Kenya. To answer your question on what stones are good for building in Kenya, it all depends on the intended use of the stones and the location of the building.</p>"
}
],
"comments" : [
{
    "id" : 1,
    "blogId" : 1,
    "text": "first comment"
},
{
    "id" : 2,
    "blogId" : 1,
    "text": "second comment of first blog"
}
],
"listings" : [
    {
        "id" : 1,
        "image" : 1,
        "price": "Ksh.380000"
    }
    ]
}